# Usage:
#   brew bundle --file=~/code/dotfiles/Brewfile
#
# Check what's missing without installing:
#   brew bundle check --file=~/code/dotfiles/Brewfile
#
# Remove anything not in this file (careful!):
#   brew bundle cleanup --file=~/code/dotfiles/Brewfile --force

# requirements for the rest
brew "lsd"
brew "bat"
brew "zsh"
brew "vim"
brew "bash"

# core
brew "git"
brew "tmux"
brew "kakoune"
brew "tree"

# zsh
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zoxide"
brew "fzf"
brew "starship"
brew "zsh-fast-syntax-highlighting"

# utilities
brew "sd"
brew "the_silver_searcher"
brew "tlrc"
brew "curl"
brew "wget"
brew "jq"
brew "p7zip"
brew "wtf"
brew "htop"
brew "calc"
brew "cointop"
brew "gnupg"
brew "watchman"
brew "git-delta"
brew "fd"
brew "gh"
brew "ripgrep"
brew "neofetch"
brew "netcat"
brew "bottom"
brew "procs"
brew "zip"
brew "mole"

# server stuff (commented out)
# brew "redis"
# brew "nginx"
# brew "postgresql"
# brew "sqlite"

# editors
brew "neovim"

# Node
brew "node"
brew "yarn"
brew "pnpm"
brew "fnm"

# Haskell
brew "ghc"
brew "cabal-install"

# Python
brew "python"

# JVM
brew "kotlin"
brew "scala"
brew "leiningen"
brew "gradle"
brew "maven"
brew "sbt"

# Ruby (commented out)
# brew "rbenv"

# Swift
brew "swiftformat"
brew "swiftlint"

# C / C++
brew "global"
brew "cmake"
brew "cmake-docs"
brew "boost"
brew "nasm"
brew "vcpkg"
brew "folly"
brew "llvm"
brew "autoconf"
brew "automake"
brew "ccache"

# Wasm
brew "emscripten"
brew "binaryen"

# images, video, ...
brew "ffmpeg"
brew "imagemagick"
brew "yt-dlp"
brew "atomicparsley"

# 6502
brew "cc65"

# OSM / maps
brew "osmosis"

# fun stuff
brew "cmatrix"
brew "lolcat"
brew "nyancat"
brew "sl"
brew "nsnake"
brew "ninvaders"
brew "bastet"

# Mac App Store CLI
brew "mas"

#
# Casks
#

# Terminals
cask "iterm2"

# Communication
cask "slack"
cask "signal"
cask "tunnelblick"

# Media
cask "iina"
cask "transmission"
cask "handbrake"

# Fonts
cask "font-hack"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# IDE / Development
cask "intellij-idea"
cask "clion"
cask "visual-studio-code"

# Browsers
cask "google-chrome"
cask "firefox"
cask "tor-browser"

# Gaming
cask "scummvm"
